<!doctype html>
<html lang="en">
<head>
<title>spanish</title>
<meta charset="utf-8">
<style> * { font-family: arial, sans-serif;
font-size: 13px;
line-height: 17px; }ul.indent { list-style-type: none; }ol { list-style-type: decimal; }ol ol { list-style-type: lower-latin; }ol ol ol { list-style-type: lower-roman; }ol ol ol ol { list-style-type: decimal; }ol ol ol ol ol { list-style-type: lower-latin; }ol ol ol ol ol ol{ list-style-type: lower-roman; }ol ol ol ol ol ol ol { list-style-type: decimal; }ol  ol ol ol ol ol ol ol{ list-style-type: lower-latin; }</style>
</head>
<body><strong>P2PU en Espa&#241;ol (p2pu.org&#x2F;es&#x2F;)</strong><br><br>Conversaci&#243;n en p2pu-community que dio inicio a este pad: <a href="https&#x3a;&#x2F;&#x2F;groups&#x2e;google&#x2e;ciom&#x2F;d&#x2F;msg&#x2F;p2pu&#x2d;community&#x2F;Bsf4cwe&#x5f;MhE&#x2F;uMNhOyf4MakJ">https:&#x2F;&#x2F;groups.google.ciom&#x2F;d&#x2F;msg&#x2F;p2pu-community&#x2F;Bsf4cwe_MhE&#x2F;uMNhOyf4MakJ</a><br><br><strong>Incicios de la traducci&#243;n de P2PU al espa&#241;ol</strong><br>La traducci&#243;n actual (may 2012) de p2pu al espa&#241;ol fue hecha en colaboracion entre: <a href="https&#x3a;&#x2F;&#x2F;github&#x2e;com&#x2F;vtamara">https:&#x2F;&#x2F;github.com&#x2F;vtamara</a> &#x2F; <a href="http&#x3a;&#x2F;&#x2F;p2pu&#x2e;org&#x2F;vtamara&#x2F;">http:&#x2F;&#x2F;p2pu.org&#x2F;vtamara&#x2F;</a> y <a href="https&#x3a;&#x2F;&#x2F;github&#x2e;com&#x2F;zuzelvp">https:&#x2F;&#x2F;github.com&#x2F;zuzelvp</a> &#x2F; <a href="http&#x3a;&#x2F;&#x2F;p2pu&#x2e;org&#x2F;zuzelvp">http:&#x2F;&#x2F;p2pu.org&#x2F;zuzelvp</a><br><br>Fichero con traducciones: <a href="https&#x3a;&#x2F;&#x2F;github&#x2e;com&#x2F;p2pu&#x2F;lernanta&#x2F;blob&#x2F;master&#x2F;lernanta&#x2F;locale&#x2F;es&#x2F;LC&#x5f;MESSAGES&#x2F;django&#x2e;po">https:&#x2F;&#x2F;github.com&#x2F;p2pu&#x2F;lernanta&#x2F;blob&#x2F;master&#x2F;lernanta&#x2F;locale&#x2F;es&#x2F;LC_MESSAGES&#x2F;django.po</a><br><br><strong>Voluntarios</strong><br><br>Adiciona tu nombre o enlace a tu profile en p2pu si estas inteado en resayud2pu (desar a traducir pde dejarnos saber cuando vez una frase que podria mejorarse hasta ayudar a editar <a href="https&#x3a;&#x2F;&#x2F;github&#x2e;com&#x2F;p2pu&#x2F;lernanta&#x2F;blob&#x2F;master&#x2F;lernanta&#x2F;locale&#x2F;es&#x2F;LC&#x5f;MESSAGES&#x2F;django&#x2e;po">https:&#x2F;&#x2F;github.com&#x2F;p2pu&#x2F;lernanta&#x2F;blob&#x2F;master&#x2F;lernanta&#x2F;locale&#x2F;es&#x2F;LC_MESSAGES&#x2F;django.po</a><br><em><u>La maraton de traduccion iniciara el viernes 1 de junio 20 hr utc-5&nbsp; hasta el domingo 3 de junio, recuerda que no necesitas conocimientos de programacion para contribuir</u></em><br><br><br><strong>Instrucciones maraton traduccion exitosa.</strong><br>0. ingresa a nuestro canal #p2pu-es en freenode<br><ol class="number"><li>En este pad, al final, estan los pads segun los voluntarios que se inscribieron.<ol class="number"><li>si tu pais no aparece no hay problema, puedes crear el pad para tu pais, siguiendo la siguiente direccion <a href="http&#x3a;&#x2F;&#x2F;pad&#x2e;p2pu&#x2e;org&#x2F;">http:&#x2F;&#x2F;pad.p2pu.org&#x2F;</a>&nbsp; y creando un pad con el formato p2pu-es-pais ej: p2pu-es-mx&nbsp; para Mexico.</li><li>de los pads que ya existen de otro pais, copia todo el contenido en el que acabas de crear y ya puedes iniciar.</li><li><strong><u>cambia el color de subrayado para saber que has hecho cambios.&nbsp;</u></strong></li></ol></li><li>El pad es una copia del archivo <a href="https&#x3a;&#x2F;&#x2F;github&#x2e;com&#x2F;p2pu&#x2F;lernanta&#x2F;blob&#x2F;master&#x2F;lernanta&#x2F;locale&#x2F;es&#x2F;LC&#x5f;MESSAGES&#x2F;django&#x2e;po">https:&#x2F;&#x2F;github.com&#x2F;p2pu&#x2F;lernanta&#x2F;blob&#x2F;master&#x2F;lernanta&#x2F;locale&#x2F;es&#x2F;LC_MESSAGES&#x2F;django.po</a>, no modifiques las lineas que empiezan por # o nada que no este en espa&#241;ol POR FAVOR.</li><li>Al iniciar el pad veras algo como,&nbsp;</li></ol><em># Localization in XXXXX Spanish</em><br><em># Public Domain. 2012. No warranties.</em><br><em># Dany Bautista &lt;danyjavierb@gmail.com&gt;,@danyjavierb</em><br><em># tu nombre,apellido, &lt;correo&gt;,twitter opcional</em><br># siempre inicia con # antes de escribir tus datos.<br>5. Usa el espa&#241;ol que hablas a diario en tu pais,<br>4. Tu ayuda es un gran avance para p2pu, no olvides unirte a nuestra lista <a href="https&#x3a;&#x2F;&#x2F;groups&#x2e;google&#x2e;com&#x2F;group&#x2F;p2pu&#x2d;espanol&#x3f;pli&#x3d;1">https:&#x2F;&#x2F;groups.google.com&#x2F;group&#x2F;p2pu-espanol?pli=1</a>.&nbsp;<br>5. Estamos buscando la forma de compensar tu ayuda, el sabado confirmaremos.<br>6. Recuerda que puedes invitar a todos tus amigos y generar la localizacion para tu pais mas rapidamente.<br>7. en todos los pads hay una sala de chat, conoce, comparte y divierte, puedes conocer al colega que estabas esperando para tu proyecto.&nbsp;&nbsp;<br><br><br><br><strong>Voluntarios localizacion espa&#241;ol</strong><br><br><ul class="bullet"><li>&nbsp;Dany Javier Bautista M - @danyjavierb - Colombia</li><li>David Felipe Camargo Polo - @davidcp90 -Colombia</li><li>&nbsp;Javier J. Crocco Mendez - @urbanjahvier - Peru</li><li>Gonzalo J. Perez Vargas - @gonzalojpv- M&#233;xico</li><li>Mario A. Garc&#237;a Mej&#237;a - @mariogmd - M&#233;xico</li><li>Gualberto D. Escalante - @gualdsk - El Salvador</li><li>Mauro Ram&#243;n - @creatified - Argentina&nbsp;&nbsp;</li></ul><br><strong>Traducciones al espa&#241;ol que vienen con Django (la plataforma de desarrollo web que usa el software de p2pu)</strong><br><br><ul class="bullet"><li>&nbsp;es: Espa&#241;ol&nbsp;</li><li>&nbsp;es-ar: Espa&#241;ol Argentino</li><li>&nbsp;es-mx: Espa&#241;ol Mejicano</li><li>&nbsp;es-ni: Espa&#241;ol Nicarag&#252;ense</li><li>es-xx Espa&#241;ol xx</li></ul><br><strong>Ideas, proyectos, sugerencias.</strong><br><br><strong><u>Dudas o consultas:</u></strong><br><ul class="bullet"><li>Mauro Ram&#243;n - @creatified - Argentina</li></ul>Quer&#237;a saber si hay que saber Django (1),&nbsp;<br>si hay que traducir o mejorar la traducci&#243;n que hay al espa&#241;ol que vi en GitHub (2),<br>o si en realidad habr&#225;n otros archicos para traducir aparte de este (y por eso es el pedido de ayuda para traducci&#243;n (3).<br><br>Sepan disculpar mi ignorancia, pero soy del &#225;rea dise&#241;o, no tengo muy firme el tema developement.<br><br>Hola Mauro, no es necesario que sepas django, solo que estes dispuesto a hacer la plataforma mas accesible en tu caso para los Argentinos.<br>Ya publicaremos las Instrucciones para la traduccion.<br><br><strong>M&#225;s dudas:</strong><br>Comenc&#233; a traducir (al argentino, espero me den una mano por ah&#237;...) la parte es-ar, pero hay partes de c&#243;digo que deben pertenecer a la forma de trabajo del Phyton.<br>Para consultar a alquien que sepa m&#225;s (parece que a vos nom&#225;s :) de esas dudas, y no fregar&#x2F;romper el c&#243;digo, quer&#237;a consultar c&#243;mo dejamos comments dentro del c&#243;digo, y c&#243;mo las responder&#237;as: ejemplo uso un trozo del c&#243;digo que me da dudas:LINE 147<br><br><strong>#: apps&#x2F;badges&#x2F;models.py:335</strong><br>msgid &quot;&quot;<br>&quot;If submission is blank, this is a peer awarded assessment or superuser &quot;<br>&quot;granted&quot;<br>msgstr &quot;&quot;<br>&quot;Si el campo env&#237;o est&#225; vac&#237;o, esta es una tarea premiada por colegas o &quot;<br>&quot;superuser granted&quot; &#x2F;&#x2F;&#x2F; estas comillas no se entiende si son para salto de l&#237;nea o &quot;forman&quot; parte del mensaje. Es decir arriba dice<br>superuser &quot;granted&quot;<br>y abajo<br>&quot;superusuario registrado&quot;, como que la palabra superusuario no existe en espa&#241;ol. <strong><em>Es as&#237;?</em></strong> &#x2F;&#x2F;&#x2F;<br><br>*** si Mauro tienes raz&#243;n... bla bla...**<br><br>&#x2F;&#x2F;&#x2F; mauro comments &#x2F;&#x2F;&#x2F;<br>Hola Mauro, traduce todo con el espa&#241;ol que tu crees que es el mas generico de Argentina, el viernes a&nbsp; partir de las 20 hrs estare conectado para responder estas dudas que creo seran un comun entre los participantes.<br><br>otra: LINE 59<br><strong>#: apps&#x2F;activity&#x2F;schema.py:26</strong><br>msgid &quot;shared&quot;<br>msgstr &quot;comparti&#243;&quot; &#x2F;&#x2F;&#x2F; falta contexto.. d&#243;nde se ve el string anterior? Puede ser compartido tambi&#233;n... depende qu&#233; dice adelante.&#x2F;&#x2F;&#x2F;&nbsp; +1<br><br><strong><em><u>LOCALIZACION POR PAIS,(Aqui va tu traduccion)</u></em></strong><br><br><a href="http&#x3a;&#x2F;&#x2F;pad&#x2e;p2pu&#x2e;org&#x2F;p&#x2F;p2pu&#x2d;es&#x2d;ar">http:&#x2F;&#x2F;pad.p2pu.org&#x2F;p&#x2F;p2pu-es-ar</a>&nbsp;&nbsp;&nbsp; Argentina&nbsp;<strong> (espero que) terminado</strong>... -&nbsp; esperando retroalimentacion<br><a href="http&#x3a;&#x2F;&#x2F;pad&#x2e;p2pu&#x2e;org&#x2F;p&#x2F;p2pu&#x2d;e&#x2d;">http:&#x2F;&#x2F;pad.p2pu.org&#x2F;p&#x2F;p2pu-e-</a> Argentis-co&nbsp;&nbsp; Colombia<br><a href="http&#x3a;&#x2F;&#x2F;pad&#x2e;p2pu&#x2e;org&#x2F;p&#x2F;p2pu&#x2d;es&#x2d;pe">http:&#x2F;&#x2F;pad.p2pu.org&#x2F;p&#x2F;p2pu-es-pe</a>&nbsp; (pendiente) Peru<br><a href="http&#x3a;&#x2F;&#x2F;pad&#x2e;p2pu&#x2e;org&#x2F;p&#x2F;p2pu&#x2d;es&#x2d;mx">http:&#x2F;&#x2F;pad.p2pu.org&#x2F;p&#x2F;p2pu-es-mx</a>&nbsp; Mexico (esperando retroalimentaci&#243;n)<br><a href="http&#x3a;&#x2F;&#x2F;pad&#x2e;p2pu&#x2e;org&#x2F;p&#x2F;p2pu&#x2d;es&#x2d;sv">http:&#x2F;&#x2F;pad.p2pu.org&#x2F;p&#x2F;p2pu-es-sv</a>&nbsp;&nbsp;&nbsp; El Salvador - esperando retroalimentacion<br>agrega a tu pais aqui.<br><br><br><br><br><br><br><br><br></body>
</html>
