<!doctype html>
<html lang="en">
<head>
<title>about-p2pu</title>
<meta charset="utf-8">
<style> * { font-family: arial, sans-serif;
font-size: 13px;
line-height: 17px; }ul.indent { list-style-type: none; }ol { list-style-type: decimal; }ol ol { list-style-type: lower-latin; }ol ol ol { list-style-type: lower-roman; }ol ol ol ol { list-style-type: decimal; }ol ol ol ol ol { list-style-type: lower-latin; }ol ol ol ol ol ol{ list-style-type: lower-roman; }ol ol ol ol ol ol ol { list-style-type: decimal; }ol  ol ol ol ol ol ol ol{ list-style-type: lower-latin; }</style>
</head>
<body>English:<br><br><strong>About P2PU</strong><br><br>P2PU is a lab for the future of learning. Our community members design free courses, use open learning materials and collaboratively build our open platform. You can find a P2PU community member on every non-polar continent, and can visit the site in 5 languages.<br>Our community is open and volunteer driven. Involvement starts with participating in courses and moves deeper into designing courses, working on site development and framing governance choices for the organization.&nbsp;&nbsp;<br><br><strong>About Courses&nbsp;</strong><br><br>There are no limitations to the subjects that can be learned at P2PU. You&#x27;ll find schools focused on the future of web development, mathematics, social innovation, and education. You&#x27;ll find a multitude of courses and challenges for subjects you didn&#x27;t even know you could master &#8211; like city-wide game design, creative activism, open mapping and poetic thinking.&nbsp;&nbsp;<br>For learners, the P2PU experience is not like any other. Though self-direction is needed, collaboration is key. Work is peer assessed and credit is given in the form of badges &#8211; emblems of accomplishment that you can carry across the web.&nbsp; Badges are designed by the community and given by peers. Courses are improved by the peers who take them, and can be remixed and remastered by anyone.&nbsp;&nbsp;<br><br><strong>Why Join</strong><br><br>At P2PU we believe everyone has something to offer. Come learn from our amazing community, and in turn let us learn from you! We are not just a platform, we are a community driven to redefine and expand how we learn and who we learn with.&nbsp;&nbsp;<br><br><br><br><br><br>Espanol:<br><br><strong>Acerca de P2PU</strong><br>P2PU es un laboratorio para el futuro del aprendizaje. Nuestros miembros de la comunidad cursos gratuitos de dise&#241;o, uso de materiales de aprendizaje abiertos y en colaboraci&#243;n construir nuestra plataforma abierta. Usted puede encontrar un miembro de la comunidad P2PU en todos los continentes no polar, y se puede visitar el sitio en [X] idiomas.<br>Nuestra comunidad est&#225; abierta. La participaci&#243;n comienza con la participaci&#243;n en cursos y se adentra en el dise&#241;o de cursos, trabajando en el desarrollo del sitio y la elaboraci&#243;n de opciones de gesti&#243;n para la organizaci&#243;n.<br><br><strong>Acerca de Cursos</strong><br>No hay limitaciones a los sujetos que pueden ser aprendidas en P2PU. Usted encontrar&#225; las escuelas centradas en el futuro del desarrollo Web, las matem&#225;ticas, la innovaci&#243;n social y la educaci&#243;n. Usted encontrar&#225; una gran cantidad de cursos y retos para los sujetos que ni siquiera sab&#237;a que se pod&#237;a dominar - al igual que el dise&#241;o del juego en toda la ciudad, el activismo creativo, la aplicaci&#243;n abierta y el pensamiento po&#233;tico.<br>Para los estudiantes, la experiencia de P2PU no es como cualquier otro. A pesar de la auto-direcci&#243;n que se necesita, la colaboraci&#243;n es la clave. El trabajo es evaluado por pares y el cr&#233;dito se da en la forma de insignias - emblemas de logros que se pueden llevar a trav&#233;s de la web.<br>Insignias han sido dise&#241;ados por la comunidad y teniendo en cuenta por sus compa&#241;eros. Los cursos son mejoradas por los compa&#241;eros que los toman, y puede ser remezclado y remasterizado por cualquier persona.<br><br><strong>&#191;Por qu&#233; unirse?</strong><br>En P2PU creemos que todo el mundo tiene algo que ofrecer. Venga y aprenda de nuestra incre&#237;ble comunidad, ya su vez vamos a aprender de ti! No somos simplemente una plataforma, somos una comunidad impulsada a redefinir y ampliar la forma en que aprendemos y que nos enteramos con.<br><br></body>
</html>
